In [1]:
# DataFrames for multi-dimensional
# We can Also make dataframe by combining two series
# seires + series = dataframe

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
series1=pd.Series([1,2,3,4])

In [5]:
series2=pd.Series([5,6,7,8])

In [6]:
# series>>>>Dict>>>>dataframe
# Dict>>>dataframe
# list >>>>> dataframe

In [7]:
data={"Series_1":series1, "Series_2":series2}

In [8]:
df=pd.DataFrame(data)

In [9]:
df

   Series_1  Series_2
0         1         5
1         2         6
2         3         7
3         4         8

# How to make dataframe from Dict

In [10]:
Dict={"Student":["Farhan","Daud","Javeria","Arooj","Talha","Hanan","Ayesha","Ali","Usama","Henrry","Denis","Sami","Shehriyaar"],
     "Age":[23,24,20,25,26,27,28,21,20,29,28,22,24],
     "CGPA":[2.3,2.4,2.5,3.5,3.4,3.6,3.8,3.9,4.0,2.1,2.9,3.4,3.9]}

In [11]:
new_df=pd.DataFrame(Dict)

In [12]:
new_df

       Student  Age  CGPA
0       Farhan   23   2.3
1         Daud   24   2.4
2      Javeria   20   2.5
3        Arooj   25   3.5
4        Talha   26   3.4
5        Hanan   27   3.6
6       Ayesha   28   3.8
7          Ali   21   3.9
8        Usama   20   4.0
9       Henrry   29   2.1
10       Denis   28   2.9
11        Sami   22   3.4
12  Shehriyaar   24   3.9

In [15]:
new_df.head() #explore what parameters add in the head function

   Student  Age  CGPA
0   Farhan   23   2.3
1     Daud   24   2.4
2  Javeria   20   2.5
3    Arooj   25   3.5
4    Talha   26   3.4

In [16]:
new_df.tail() #explore what parameters add in the tail function

       Student  Age  CGPA
8        Usama   20   4.0
9       Henrry   29   2.1
10       Denis   28   2.9
11        Sami   22   3.4
12  Shehriyaar   24   3.9

In [17]:
new_df.columns

Index(['Student', 'Age', 'CGPA'], dtype='object')

In [18]:
new_df.index

RangeIndex(start=0, stop=13, step=1)

In [19]:
new_df.values

array([['Farhan', 23, 2.3],
       ['Daud', 24, 2.4],
       ['Javeria', 20, 2.5],
       ['Arooj', 25, 3.5],
       ['Talha', 26, 3.4],
       ['Hanan', 27, 3.6],
       ['Ayesha', 28, 3.8],
       ['Ali', 21, 3.9],
       ['Usama', 20, 4.0],
       ['Henrry', 29, 2.1],
       ['Denis', 28, 2.9],
       ['Sami', 22, 3.4],
       ['Shehriyaar', 24, 3.9]], dtype=object)

In [20]:
new_df.shape

(13, 3)

In [21]:
new_df.ndim

2

# how to access data from dataframes

In [22]:
new_df["Student"]

0         Farhan
1           Daud
2        Javeria
3          Arooj
4          Talha
5          Hanan
6         Ayesha
7            Ali
8          Usama
9         Henrry
10         Denis
11          Sami
12    Shehriyaar
Name: Student, dtype: object

In [23]:
new_df["CGPA"]

0     2.3
1     2.4
2     2.5
3     3.5
4     3.4
5     3.6
6     3.8
7     3.9
8     4.0
9     2.1
10    2.9
11    3.4
12    3.9
Name: CGPA, dtype: float64

In [24]:
new_df["Age"]

0     23
1     24
2     20
3     25
4     26
5     27
6     28
7     21
8     20
9     29
10    28
11    22
12    24
Name: Age, dtype: int64

In [25]:
ln=len(new_df)

In [26]:
ln

13

In [27]:
new_df["CGPA"]

0     2.3
1     2.4
2     2.5
3     3.5
4     3.4
5     3.6
6     3.8
7     3.9
8     4.0
9     2.1
10    2.9
11    3.4
12    3.9
Name: CGPA, dtype: float64

In [28]:
new_df["CGPA"].min()

2.1

In [29]:
new_df["CGPA"].max()

4.0

In [30]:
new_df["CGPA"].max()-new_df["CGPA"].min()

1.9

In [31]:
new_df[["CGPA",'Student']]

    CGPA     Student
0    2.3      Farhan
1    2.4        Daud
2    2.5     Javeria
3    3.5       Arooj
4    3.4       Talha
5    3.6       Hanan
6    3.8      Ayesha
7    3.9         Ali
8    4.0       Usama
9    2.1      Henrry
10   2.9       Denis
11   3.4        Sami
12   3.9  Shehriyaar

In [32]:
new_df

       Student  Age  CGPA
0       Farhan   23   2.3
1         Daud   24   2.4
2      Javeria   20   2.5
3        Arooj   25   3.5
4        Talha   26   3.4
5        Hanan   27   3.6
6       Ayesha   28   3.8
7          Ali   21   3.9
8        Usama   20   4.0
9       Henrry   29   2.1
10       Denis   28   2.9
11        Sami   22   3.4
12  Shehriyaar   24   3.9

In [33]:
new_df["Country"]="Pakistan"

In [34]:
new_df

       Student  Age  CGPA   Country
0       Farhan   23   2.3  Pakistan
1         Daud   24   2.4  Pakistan
2      Javeria   20   2.5  Pakistan
3        Arooj   25   3.5  Pakistan
4        Talha   26   3.4  Pakistan
5        Hanan   27   3.6  Pakistan
6       Ayesha   28   3.8  Pakistan
7          Ali   21   3.9  Pakistan
8        Usama   20   4.0  Pakistan
9       Henrry   29   2.1  Pakistan
10       Denis   28   2.9  Pakistan
11        Sami   22   3.4  Pakistan
12  Shehriyaar   24   3.9  Pakistan

In [35]:
new_df["City"]=["Faisalabad","Lahore","Islamabad","karachi","Multan","Layyia","khushaab","Gojra","Faisalabad","Lahore","Khushab","Faisalabad","Islamabad",]

In [36]:
new_df

       Student  Age  CGPA   Country        City
0       Farhan   23   2.3  Pakistan  Faisalabad
1         Daud   24   2.4  Pakistan      Lahore
2      Javeria   20   2.5  Pakistan   Islamabad
3        Arooj   25   3.5  Pakistan     karachi
4        Talha   26   3.4  Pakistan      Multan
5        Hanan   27   3.6  Pakistan      Layyia
6       Ayesha   28   3.8  Pakistan    khushaab
7          Ali   21   3.9  Pakistan       Gojra
8        Usama   20   4.0  Pakistan  Faisalabad
9       Henrry   29   2.1  Pakistan      Lahore
10       Denis   28   2.9  Pakistan     Khushab
11        Sami   22   3.4  Pakistan  Faisalabad
12  Shehriyaar   24   3.9  Pakistan   Islamabad

In [37]:
new_df["Status"]=["Pass" if CGPA>2.5 else "Fail" for CGPA in new_df["CGPA"]]

In [38]:
new_df

       Student  Age  CGPA   Country        City Status
0       Farhan   23   2.3  Pakistan  Faisalabad   Fail
1         Daud   24   2.4  Pakistan      Lahore   Fail
2      Javeria   20   2.5  Pakistan   Islamabad   Fail
3        Arooj   25   3.5  Pakistan     karachi   Pass
4        Talha   26   3.4  Pakistan      Multan   Pass
5        Hanan   27   3.6  Pakistan      Layyia   Pass
6       Ayesha   28   3.8  Pakistan    khushaab   Pass
7          Ali   21   3.9  Pakistan       Gojra   Pass
8        Usama   20   4.0  Pakistan  Faisalabad   Pass
9       Henrry   29   2.1  Pakistan      Lahore   Fail
10       Denis   28   2.9  Pakistan     Khushab   Pass
11        Sami   22   3.4  Pakistan  Faisalabad   Pass
12  Shehriyaar   24   3.9  Pakistan   Islamabad   Pass

In [43]:
new_df["Marital Status"]="Unmarried"

In [44]:
new_df

       Student  Age  CGPA   Country        City Status Marital Status
0       Farhan   23   2.3  Pakistan  Faisalabad   Fail      Unmarried
1         Daud   24   2.4  Pakistan      Lahore   Fail      Unmarried
2      Javeria   20   2.5  Pakistan   Islamabad   Fail      Unmarried
3        Arooj   25   3.5  Pakistan     karachi   Pass      Unmarried
4        Talha   26   3.4  Pakistan      Multan   Pass      Unmarried
5        Hanan   27   3.6  Pakistan      Layyia   Pass      Unmarried
6       Ayesha   28   3.8  Pakistan    khushaab   Pass      Unmarried
7          Ali   21   3.9  Pakistan       Gojra   Pass      Unmarried
8        Usama   20   4.0  Pakistan  Faisalabad   Pass      Unmarried
9       Henrry   29   2.1  Pakistan      Lahore   Fail      Unmarried
10       Denis   28   2.9  Pakistan     Khushab   Pass      Unmarried
11        Sami   22   3.4  Pakistan  Faisalabad   Pass      Unmarried
12  Shehriyaar   24   3.9  Pakistan   Islamabad   Pass      Unmarried

# DataFrame From Python_List

In [45]:
list=[[1,2,3,4,5],[6,7,8,9,10]]

In [53]:
list_df=pd.DataFrame(list,index=[1,2],columns=["A","B","C","D","E"])

In [54]:
list_df

   A  B  C  D   E
1  1  2  3  4   5
2  6  7  8  9  10

In [55]:
new_df

       Student  Age  CGPA   Country        City Status Marital Status
0       Farhan   23   2.3  Pakistan  Faisalabad   Fail      Unmarried
1         Daud   24   2.4  Pakistan      Lahore   Fail      Unmarried
2      Javeria   20   2.5  Pakistan   Islamabad   Fail      Unmarried
3        Arooj   25   3.5  Pakistan     karachi   Pass      Unmarried
4        Talha   26   3.4  Pakistan      Multan   Pass      Unmarried
5        Hanan   27   3.6  Pakistan      Layyia   Pass      Unmarried
6       Ayesha   28   3.8  Pakistan    khushaab   Pass      Unmarried
7          Ali   21   3.9  Pakistan       Gojra   Pass      Unmarried
8        Usama   20   4.0  Pakistan  Faisalabad   Pass      Unmarried
9       Henrry   29   2.1  Pakistan      Lahore   Fail      Unmarried
10       Denis   28   2.9  Pakistan     Khushab   Pass      Unmarried
11        Sami   22   3.4  Pakistan  Faisalabad   Pass      Unmarried
12  Shehriyaar   24   3.9  Pakistan   Islamabad   Pass      Unmarried

In [65]:
np.any(CGPA>3)

NameError: name 'CGPA' is not defined

In [68]:
week_days={"a":"b","c":"d","e":"f","g":"h"}
week_series=pd.Series(week_days)
week_series
print(week_series.any())

True

In [69]:
print(week_series.any())

True

In [61]:
ar=np.array([1,2,3,4])

In [62]:
ar

array([1, 2, 3, 4])

In [67]:
np.any(ar>5)

False